{
  "1.N.1": "Say the number sequence by",
  "1.N.2": "Subitize and name familiar arrangements of 1 to 10 dots (or objects).",
  "1.N.3": "Demonstrate an understanding of counting by",
  "1.N.4": "Represent and describe numbers to 20, concretely, pictorially, and symbolically.",
  "1.N.5": "Compare and order sets containing up to 20 elements to solve problems using",
  "1.N.6": "Estimate quantities to 20 by using referents.",
  "1.N.7": "Demonstrate, concretely and pictorially, how a number, up to 30, can be represented by a variety of equal groups with and without singles.",
  "1.N.8": "Identify the number, up to 20, that is one more, two more, one less, and two less than a given number.",
  "1.N.9": "Demonstrate an understanding of addition of numbers with answers to 20 and their corresponding subtraction facts, concretely, pictorially, and symbolically, by",
  "1.N.10": "Describe and use mental mathematics strategies including",
  "1.PR.1": "Demonstrate an understanding of repeating patterns (two to four elements) by",
  "1.PR.2": "Translate repeating patterns from one representation to another.",
  "1.PR.3": "Describe equality as a balance and inequality as an imbalance, concretely and pictorially (0 to 20).",
  "1.PR.4": "Record equalities using the equal symbol (0 to 20).",
  "1.SS.1": "Demonstrate an understanding of measurement as a process of comparing by",
  "1.SS.2": "Sort 3-D objects and 2-D shapes using one attribute, and explain the sorting rule.",
  "1.SS.3": "Replicate composite 2-D shapes and 3-D objects.",
  "1.SS.4": "Compare 2-D shapes to parts of 3-D objects in the environment.",
  "2.N.1.": "Say the number sequence from 0 to 100 by",
  "2.N.2.": "Demonstrate if a number (up to 100) is even or odd.",
  "2.N.3.": "Describe order or relative position using ordinal numbers.",
  "2.N.4.": "Represent and describe numbers to 100, concretely, pictorially, and symbolically.",
  "2.N.5.": "Compare and order numbers up to 100.",
  "2.N.6.": "Estimate quantities to 100 using referents.",
  "2.N.7.": "Illustrate, concretely and pictorially, the meaning of place value for numbers to 100.",
  "2.N.8.": "Demonstrate and explain the effect of adding zero to or subtracting zero from any number.",
  "2.N.9.": "Demonstrate an understanding of addition (limited to 1- and 2-digit numerals) with answers to 100 and the corresponding subtraction by",
  "2.N.10.": "Apply mental mathematics strategies, including to develop recall of basic addition facts to 18 and related subtraction facts.",
  "2.PR.1.": "Predict an element in a repeating pattern using a variety of strategies.",
  "2.PR.2.": "Demonstrate an understanding of increasing patterns by patterns using manipulatives, diagrams, sounds, and actions (numbers to 100).",
  "2.PR.3.": "Demonstrate and explain the meaning of equality and inequality by using manipulatives and diagrams (0 to 100).",
  "2.PR.4.": "Record equalities and inequalities symbolically using the equal symbol or the not-equal symbol.",
  "2.SS.1.": "Relate the number of days to a week and the number of months to a year in a problem-solving context.",
  "2.SS.2.": "Relate the size of a unit of measure to the number of units (limited to non-standard units) used to measure length and mass (weight).",
  "2.SS.3.": "Compare and order objects by length, height, distance around, and mass (weight) using non-standard units, and make statements of comparison.",
  "2.SS.4.": "Measure length to the nearest non-standard unit by",
  "2.SS.5.": "Demonstrate that changing the orientation of an object does not alter the measurements of its attributes.",
  "2.SS.6.": "Sort 2-D shapes and 3-D objects using two attributes, and explain the sorting rule.",
  "2.SS.7.": "Describe, compare, and construct 3-D objects, including",
  "2.SS.8.": "Describe, compare, and construct 2-D shapes, including",
  "2.SS.9.": "Identify 2-D shapes as parts of 3-D objects in the environment.",
  "2.SP.1.": "Gather and record data about self and others to answer questions.",
  "2.SP.2.": "Construct and interpret concrete graphs and pictographs to solve problems.",
  "3.N.1.": "Say the number sequence between any two given numbers forward and backward",
  "3.N.2.": "Represent and describe numbers to 1000, concretely, pictorially, and symbolically.",
  "3.N.3.": "Compare and order numbers to 1000.",
  "3.N.4.": "Estimate quantities less than 1000 using referents.",
  "3.N.5.": "Illustrate, concretely and pictorially, the meaning of place value for numerals to 1000.",
  "3.N.6.": "Describe and apply mental mathematics strategies for adding two 2-digit numerals, such as",
  "3.N.7.": "Describe and apply mental mathematics strategies for subtracting two 2-digit numerals, such as",
  "3.N.8.": "Apply estimation strategies to predict sums and differences of two 2-digit numerals in a problem-solving context.",
  "3.N.9.": "Demonstrate an understanding of addition and subtraction of numbers with answers to 1000 (limited to 1-, 2-, and 3-digit numerals) by",
  "3.N.10.": "Apply mental math strategies to determine addition facts and related subtraction facts to 18 (9 + 9).",
  "3.N.11.": "Demonstrate an understanding of multiplication to 5 × 5 by",
  "3.N.12.": "Demonstrate an understanding of division by",
  "3.N.13.": "Demonstrate an understanding of fractions by",
  "3.PR.1.": "Demonstrate an understanding of increasing patterns by",
  "3.PR.2.": "Demonstrate an understanding of decreasing patterns by",
  "3.PR.3.": "Solve one-step addition and subtraction equations involving symbols representing an unknown number.",
  "3.SS.1.": "Relate the passage of time to common activities using non-standard and standard units (minutes, hours, days, weeks, months, years).",
  "3.SS.2.": "Relate the number of seconds to a minute, the number of minutes to an hour, and the number of days to a month in a problem-solving context.",
  "3.SS.3.": "Demonstrate an understanding of measuring length (cm, m) by",
  "3.SS.4.": "Demonstrate an understanding of measuring mass (g, kg) by",
  "3.SS.5.": "Demonstrate an understanding of perimeter of regular and irregular shapes by",
  "3.SS.6.": "Describe 3-D objects according to the shape of the faces, and the number of edges and vertices.",
  "3.SS.7.": "Sort regular and irregular polygons, including",
  "3.SP.1.": "Collect first-hand data and organize it using",
  "3.SP.2.": "Construct, label, and interpret bar graphs to solve problems.",
  "4.N.1.": "Represent and describe whole numbers to 10 000, pictorially and symbolically.",
  "4.N.2.": "Compare and order numbers to 10 000.",
  "4.N.3.": "Demonstrate an understanding of addition of numbers with answers to 10 000 and their corresponding subtractions (limited to 3- and 4-digit numerals), concretely, pictorially, and symbolically, by",
  "4.N.4.": "Explain the properties of 0 and 1 for multiplication and the property of 1 for division.",
  "4.N.5.": "Describe and apply mental mathematics strategies, such as",
  "4.N.6.": "Demonstrate an understanding of multiplication (2- or 3-digit numerals by 1-digit numerals) to solve problems by",
  "4.N.7.": "Demonstrate an understanding of division (1-digit divisor and up to 2-digit dividend) to solve problems by",
  "4.N.8.": "Demonstrate an understanding of fractions less than or equal to one by using concrete and pictorial representations to",
  "4.N.9.": "Describe and represent decimals (tenths and hundredths), concretely, pictorially, and symbolically.",
  "4.N.10.": "Relate decimals to fractions (to hundredths).",
  "4.N.11.": "Demonstrate an understanding of addition and subtraction of decimals (limited to hundredths) by",
  "4.PR.1.": "Identify and describe patterns found in tables and charts, including a multiplication chart.",
  "4.PR.2.": "Reproduce a pattern shown in a table or chart using concrete materials.",
  "4.PR.3.": "Represent and describe patterns and relationships using charts and tables to solve problems.",
  "4.PR.4.": "Identify and explain mathematical relationships using charts and diagrams to solve problems.",
  "4.PR.5.": "Express a problem as an equation in which a symbol is used to represent an unknown number.",
  "4.PR.6.": "Solve one-step equations involving a symbol to represent an unknown number.",
  "4.SS.1.": "Read and record time using digital and analog clocks, including 24-hour clocks.",
  "4.SS.2.": "Read and record calendar dates in a variety of formats.",
  "4.SS.3.": "Demonstrate an understanding of area of regular and irregular 2-D shapes by",
  "4.SS.4.": "Solve problems involving 2-D shapes and 3-D objects.",
  "4.SS.5.": "Describe and construct rectangular and triangular prisms.",
  "4.SS.6.": "Demonstrate an understanding of line symmetry by",
  "4.SP.1.": "Demonstrate an understanding of many-to-one correspondence.",
  "4.SP.2.": "Construct and interpret pictographs and bar graphs involving many-to-one correspondence to draw conclusions.",
  "5.N.1.": "Represent and describe whole numbers to 1 000 000.",
  "5.N.2.": "Apply estimation strategies, including in problem-solving contexts.",
  "5.N.3.": "Apply mental math strategies to determine multiplication and related division facts to 81 (9 x 9).",
  "5.N.4.": "Apply mental mathematics strategies for multiplication, such as",
  "5.N.5.": "Demonstrate an understanding of multiplication (1- and 2-digit multipliers and up to 4-digit multiplicands), concretely, pictorially, and symbolically, by to solve problems.",
  "5.N.6.": "Demonstrate an understanding of division (1- and 2-digit divisors and up to 4-digit dividends), concretely, pictorially, and symbolically, and interpret remainders by to solve problems.",
  "5.N.7.": "Demonstrate an understanding of fractions by using concrete and pictorial representations to",
  "5.N.8.": "Describe and represent decimals (tenths, hundredths, thousandths) concretely, pictorially, and symbolically.",
  "5.N.9.": "Relate decimals to fractions (tenths, hundredths, thousandths).",
  "5.N.10.": "Compare and order decimals (tenths, hundredths, thousandths) by using",
  "5.N.11.": "Demonstrate an understanding of addition and subtraction of decimals (to thousandths), concretely, pictorially, and symbolically, by",
  "5.PR.1.": "Determine the pattern rule to make predictions about subsequent elements.",
  "5.PR.2.": "Solve problems involving single-variable (expressed as symbols or letters), one-step equations with whole-number coefficients, and whole-number solutions.",
  "5.SS.1.": "Design and construct different rectangles given either perimeter or area or both (whole numbers), and draw conclusions.",
  "5.SS.2.": "Demonstrate an understanding of measuring length (mm) by",
  "5.SS.3.": "Demonstrate an understanding of volume by",
  "5.SS.4.": "Demonstrate an understanding of capacity by",
  "5.SS.5.": "Describe and provide examples of edges and faces of 3-D objects, and sides of 2-D shapes, that are",
  "5.SS.6.": "Identify and sort quadrilaterals, including according to their attributes.",
  "5.SS.7.": "Perform a single transformation (translation, rotation, or reflection) of a 2-D shape, and draw and describe the image.",
  "5.SS.8.": "Identify a single transformation (translation, rotation, or reflection) of 2-D shapes.",
  "5.SP.1.": "Differentiate between first-hand and second-hand data.",
  "5.SP.2.": "Construct and interpret double bar graphs to draw conclusions.",
  "5.SP.3.": "Describe the likelihood of a single outcome occurring, using words such as",
  "5.SP.4.": "Compare the likelihood of two possible outcomes occurring, using words such as",
  "6.N.1.": "Demonstrate an understanding of place value for numbers",
  "6.N.2.": "Solve problems involving large numbers, using technology.",
  "6.N.3.": "Demonstrate an understanding of factors and multiples by",
  "6.N.4.": "Relate improper fractions to mixed numbers.",
  "6.N.5.": "Demonstrate an understanding of ratio, concretely, pictorially, and symbolically.",
  "6.N.6.": "Demonstrate an understanding of percent (limited to whole numbers), concretely, pictorially, and symbolically.",
  "6.N.7.": "Demonstrate an understanding of integers, concretely, pictorially, and symbolically.",
  "6.N.8.": "Demonstrate an understanding of multiplication and division of decimals (involving 1-digit whole-number multipliers, 1-digit natural number divisors, and multipliers and divisors that are multiples of 10), concretely, pictorially, and symbolically, by",
  "6.N.9.": "Explain and apply the order of operations, excluding exponents (limited to whole numbers).",
  "6.PR.1.": "Demonstrate an understanding of the relationships within tables of values to solve problems.",
  "6.PR.2.": "Represent and describe patterns and relationships using graphs and tables.",
  "6.PR.3.": "Represent generalizations arising from number relationships using equations with letter variables.",
  "6.PR.4.": "Demonstrate and explain the meaning of preservation of equality, concretely, pictorially, and symbolically.",
  "6.SS.1.": "Demonstrate an understanding of angles by",
  "6.SS.2.": "Demonstrate that the sum of interior angles is",
  "6.SS.3.": "Develop and apply a formula for determining the",
  "6.SS.4.": "Construct and compare triangles, including",
  "6.SS.5.": "Describe and compare the sides and angles of regular and irregular polygons.",
  "6.SS.6.": "Perform a combination of transformations (translations, rotations, or reflections) on a single 2-D shape, and draw and describe the image.",
  "6.SS.7.": "Perform a combination of successive transformations of 2-D shapes to create a design, and identify and describe the transformations.",
  "6.SS.8.": "Identify and plot points in the first quadrant of a Cartesian plane using whole-number ordered pairs.",
  "6.SS.9.": "Perform and describe single transformations of a 2-D shape in the first quadrant of a Cartesian plane (limited to whole-number vertices).",
  "6.SP.1.": "Create, label, and interpret line graphs to draw conclusions.",
  "6.SP.2.": "Select, justify, and use appropriate methods of collecting data, including",
  "6.SP.3.": "Graph collected data and analyze the graph to solve problems.",
  "6.SP.4.": "Demonstrate an understanding of probability by",
  "7.N.1": "Determine and explain why a number is divisible by 2, 3, 4, 5, 6, 8, 9, or 10, and why a number cannot be divided by 0.",
  "7.N.2": "Demonstrate an understanding of the addition, subtraction, multiplication, and division of decimals to solve problems (for more than 1-digit divisors or 2-digit multipliers, technology could be used).",
  "7.N.3": "Solve problems involving percents from 1% to 100%.",
  "7.N.4": "Demonstrate an understanding of the relationship between repeating decimals and fractions, and terminating decimals and fractions.",
  "7.N.5": "Demonstrate an understanding of adding and subtracting positive fractions and mixed numbers, with like and unlike denominators, concretely, pictorially, and symbolically (limited to positive sums and differences).",
  "7.N.6": "Demonstrate an understanding of addition and subtraction of integers, concretely, pictorially, and symbolically.",
  "7.N.7": "Compare and order fractions, decimals (to thousandths), and integers by using",
  "7.PR.1": "Demonstrate an understanding of oral and written patterns and their corresponding relations.",
  "7.PR.2": "Construct a table of values from a relation, graph the table of values, and analyze the graph to draw conclusions and solve problems.",
  "7.PR.3": "Demonstrate an understanding of preservation of equality by",
  "7.PR.4": "Explain the difference between an expression and an equation.",
  "7.PR.5": "Evaluate an expression given the value of the variable(s).",
  "7.PR.6": "Model and solve problems that can be represented by one-step linear equations of the form x + a = b, concretely, pictorially, and symbolically, where a and b are integers.",
  "7.PR.7": "Model and solve problems that can be represented by linear equations of the form: concretely, pictorially, and symbolically, where a, b, and c, are whole numbers.",
  "7.SS.1": "Demonstrate an understanding of circles by",
  "7.SS.2": "Develop and apply a formula for determining the area of",
  "7.SS.3": "Perform geometric constructions, including",
  "7.SS.4": "Identify and plot points in the four quadrants of a Cartesian plane using ordered pairs.",
  "7.SS.5": "Perform and describe transformations of a 2-D shape in all four quadrants of a Cartesian plane (limited to integral vertices).",
  "7.SP.1": "Demonstrate an understanding of central tendency and range by",
  "7.SP.2": "Determine the effect on the mean, median, and mode when an outlier is included in a data set.",
  "7.SP.3": "Construct, label, and interpret circle graphs to solve problems.",
  "7.SP.4": "Express probabilities as ratios, fractions, and percents.",
  "7.SP.5": "Identify the sample space (where the combined sample space has 36 or fewer elements) for a probability experiment involving two independent events.",
  "7.SP.6": "Conduct a probability experiment to compare the theoretical probability (determined using a tree diagram, table, or another graphic organizer) and experimental probability of two independent events.",
  "8.N.1": "Demonstrate an understanding of perfect squares and square roots, concretely, pictorially, and symbolically (limited to whole numbers).",
  "8.N.2": "Determine the approximate square root of numbers that are not perfect squares (limited to whole numbers).",
  "8.N.3": "Demonstrate an understanding of percents greater than or equal to 0%.",
  "8.N.4": "Demonstrate an understanding of ratio and rate.",
  "8.N.5": "Solve problems that involve rates, ratios, and proportional reasoning.",
  "8.N.6": "Demonstrate an understanding of multiplying and dividing positive fractions and mixed numbers, concretely, pictorially, and symbolically.",
  "8.N.7": "Demonstrate an understanding of multiplication and division of integers, concretely, pictorially, and symbolically.",
  "8.N.8": "Solve problems involving positive rational numbers.",
  "8.PR.1": "Graph and analyze two-variable linear relations.",
  "8.PR.2": "Model and solve problems using linear equations of the form: ax = b, b, a ≠ 0, ax + b = c, + b = c, a ≠ 0, a(x + b) = c concretely, pictorially, and symbolically, where a, b, and c, are integers.",
  "8.SS.1": "Develop and apply the Pythagorean theorem to solve problems.",
  "8.SS.2": "Draw and construct nets for 3-D objects.",
  "8.SS.3": "Determine the surface area of right rectangular prisms, right triangular prisms, right cylinders to solve problems.",
  "8.SS.4": "Develop and apply formulas for determining the volume of right prisms and right cylinders.",
  "8.SS.5": "Draw and interpret top, front, and side views of 3-D objects composed of right rectangular prisms.",
  "8.SS.6": "Demonstrate an understanding of tessellation.",
  "8.SP.1": "Critique ways in which data are presented.",
  "8.SP.2": "Solve problems involving the probability of independent events.",
  "9.N.1.": "Demonstrate an understanding of powers with integral bases (excluding base 0) and whole-number exponents by",
  "9.N.2.": "Demonstrate an understanding of operations on powers with integral bases (excluding base 0) and whole-number exponents.",
  "9.N.3.": "Demonstrate an understanding of rational numbers by",
  "9.N.4.": "Explain and apply the order of operations, including exponents, with and without technology.",
  "9.N.5.": "Determine the square root of positive rational numbers that are perfect squares.",
  "9.N.6.": "Determine an approximate square root of positive rational numbers that are non-perfect squares.",
  "9.PR.1.": "Generalize a pattern arising from a problem-solving context using linear equations, and verify by substitution.",
  "9.PR.2.": "Graph linear relations, analyze the graph, and interpolate or extrapolate to solve problems.",
  "9.PR.3.": "Model and solve problems using linear equations of the form",
  "9.PR.4.": "Explain and illustrate strategies to solve single variable linear inequalities with rational coefficients within a problem-solving context.",
  "9.PR.5.": "Demonstrate an understanding of polynomials (limited to polynomials of degree less than or equal to 2).",
  "9.PR.6.": "Model, record, and explain the operations of addition and subtraction of polynomial expressions, concretely, pictorially, and symbolically (limited to polynomials of degree less than or equal to 2).",
  "9.PR.7.": "Model, record, and explain the operations of multiplication and division of polynomial expressions (limited to polynomials of degree less than or equal to 2) by monomials, concretely, pictorially, and symbolically.",
  "9.SS.1.": "Solve problems and justify the solution strategy using circle properties, including",
  "9.SS.2.": "Determine the surface area of composite 3-D objects to solve problems.",
  "9.SS.3.": "Demonstrate an understanding of similarity of polygons.",
  "9.SS.4.": "Draw and interpret scale diagrams of 2-D shapes.",
  "9.SS.5.": "Demonstrate an understanding of line and rotation symmetry.",
  "9.SP.1.": "Describe the effect of",
  "9.SP.2.": "Select and defend the choice of using either a population or a sample of a population to answer a question.",
  "9.SP.3.": "Develop and implement a project plan for the collection, display, and analysis of data by",
  "9.SP.4.": "Demonstrate an understanding of the role of probability in society."
}